DataProcessors/МобильноеРабочееМестоКладовщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>МобильноеРабочееМестоКладовщика</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/УпаковкиЕдиницыИзмерения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УпаковкиЕдиницыИзмерения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.НаборыУпаковок</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Безразмерная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глубина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Числитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Знаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинейныеРазмерыПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеГруппыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипоразмерыУпаковок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляетсяВМногооборотнойТаре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураМногооборотнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаМногооборотнаяТара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальноеКоличествоУпаковокМногооборотнойТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИзмеряемойВеличины</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИзмеряемыхВеличин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеСокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыУпаковокНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СерииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерСерии</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКиЗГИСМ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерКиЗГИСМ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EPCGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDМеткаНеЧитаемая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Справка2ЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводительВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьСкладскогоЖурналаВЕТИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаписиСкладскогоЖурналаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПартииВЕТИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаВЕТИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяРозничнаяЦенаМОТП</Name>
					<Comment>Максимальная розничная цена (МОТП)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыНоменклатуры</xr:Item>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принципал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатурыДляЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПолное</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/МобильноеРабочееМестоКладовщика/Forms/КарточкаТовара/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура          = Параметры.Номенклатура;
	Характеристика        = Параметры.Характеристика;
	Упаковка              = Параметры.Упаковка;
	ВидНоменклатуры       = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидНоменклатуры");
	ПоказыватьФотоТоваров = Параметры.ПоказыватьФотоТоваров;
	СрокГодности          = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(Номенклатура, "СрокГодности");
	ШтрихкодДокумента     = Параметры.ШтрихкодДокумента;
	ПорядокСканирования   = Параметры.ПорядокСканирования;
	
	Если Параметры.Свойство("Склад") Тогда
		Склад = Параметры.Склад;
	КонецЕсли;
	
	Если Параметры.Свойство("ДокументИсточник") Тогда
		ДокументИсточник = Параметры.ДокументИсточник;
	КонецЕсли;
	
	Если Параметры.Свойство("РаспоряжениеНаПоступление") Тогда
		РаспоряжениеНаПоступление = Параметры.РаспоряжениеНаПоступление;
	КонецЕсли;
	
	Если Параметры.Свойство("РаспоряжениеНаОтбор") Тогда
		РаспоряжениеНаОтбор = Параметры.РаспоряжениеНаОтбор;
	КонецЕсли;
	
	Если Параметры.Свойство("СкладскаяОперация") Тогда
		СкладскаяОперация = Параметры.СкладскаяОперация;
	КонецЕсли;
	
	Если Параметры.Свойство("Помещение") Тогда
		Помещение = Параметры.Помещение;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Упаковка) Тогда
		Упаковка = ЕдиницаИзмеренияНоменклатуры();
	КонецЕсли;
	
	Если Параметры.Свойство("Серия") Тогда
		Серия = Параметры.Серия;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры") Тогда
		Элементы.ГруппаСерия.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Артикул") Тогда
		Артикул = Параметры.Артикул;
	КонецЕсли;
	
	Если Параметры.Свойство("ШтрихкодУпаковки") И ЗначениеЗаполнено(Параметры.ШтрихкодУпаковки) Тогда
		СтрокаШтрихкод = ШтрихкодыУпаковок.Добавить();
		СтрокаШтрихкод.ШтрихкодУпаковки = Параметры.ШтрихкодУпаковки;
		СтрокаШтрихкод.Номенклатура     = Параметры.Номенклатура;
		СтрокаШтрихкод.Характеристика   = Параметры.Характеристика;
	КонецЕсли;
	
	ИспользоватьХарактеристики = МобильноеРабочееМестоКладовщика.ХарактеристикиИспользуются(Номенклатура);
	
	Если Параметры.Свойство("Количество") Тогда
		КоличествоУпаковок             = Параметры.Количество;		
		МаксимальноеКоличествоУпаковок = Параметры.Количество;
	КонецЕсли;

	Если Параметры.Свойство("Назначение") Тогда
		Назначение = Параметры.Назначение;
	КонецЕсли; 
	
	Если Параметры.Свойство("Ячейка") Тогда
		Ячейка = Параметры.Ячейка;
	КонецЕсли;
	
	Режим = Параметры.Режим;
	Литерал = "НомерСтроки";
	НомерСтроки = Параметры[Литерал];
	
	СвойстваСклада = Обработки.МобильноеРабочееМестоКладовщика.СвойстваСклада(Склад);
	Если ЗначениеЗаполнено(СвойстваСклада) Тогда
		ИспользоватьАдресноеХранение            = СвойстваСклада.ИспользоватьАдресноеХранение;
		ИспользоватьОрдернуюСхемуПриПоступлении = СвойстваСклада.ИспользоватьОрдернуюСхемуПриПоступлении;
		ИспользоватьСкладскиеПомещения          = СвойстваСклада.ИспользоватьСкладскиеПомещения;
	КонецЕсли;
	
	Если СвойстваСклада.ИспользоватьСкладскиеПомещения Тогда
		СтруктураПомещения = МобильноеРабочееМестоКладовщика.ЗначенияРеквизитовОбъекта(Помещение, "ИспользоватьАдресноеХранение");
		ИспользоватьАдресноеХранение = СтруктураПомещения.ИспользоватьАдресноеХранение;
	КонецЕсли;
	
#Если НЕ МобильныйАвтономныйСервер Тогда
	Если ПоказыватьФотоТоваров Тогда 
		Элементы.ГруппаФотоДобавить.Доступность = ПравоДоступа("Добавление", Метаданные.Справочники.НоменклатураПрисоединенныеФайлы);
		ЗагрузитьФотоТовара(); 
	Иначе
		Элементы.ФотоТоваров.Видимость = Ложь;
	КонецЕсли;
#Иначе
	Элементы.ФотоТоваров.Видимость = Ложь;
#КонецЕсли
	
	ЗаполнитьСвязиПараметровВыбораНазначения();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		// ПодключаемоеОборудование
		Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда 
			
		ЕстьНеобработанноеСобытие = МобильноеРабочееМестоКладовщикаКлиент.ЕстьНеобработанноеСобытие();
			
			Если ИмяСобытия = "ScanData" И ЕстьНеобработанноеСобытие Тогда
				
				Данные = МобильноеРабочееМестоКладовщикаКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
				
				ОбработатьШтрихкод(Данные);
			
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "Запись_СерииНоменклатуры" И ЗначениеЗаполнено(Источник) Тогда
		Серия = Источник;
	КонецЕсли;
	
	ИмяСобытия = Неопределено;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Справочник.УпаковкиЕдиницыИзмерения.Форма.ФормаВыбораИзДокументов")
		Или ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Справочник.УпаковкиЕдиницыИзмерения.Форма.ФормаВыбораИзДокументовАвтономныйРежим") Тогда
		
		Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
			Упаковка = ВыбранноеЗначение;
		Иначе
			Упаковка = ЕдиницаИзмеренияНоменклатуры();
		КонецЕсли;
		
		Элементы.Упаковка.Заголовок = Упаковка;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если Элементы.ВыбратьЯчейку.Видимость 
		И Ячейка.Пустая() И ПорядокСканирования = "СначалаСканированиеТовара" Тогда
		Состояние(НСтр("ru = 'Укажите ячейку'"));
		Возврат;
	КонецЕсли;
	
	ЗакрытьКарточкуТовара();
	
КонецПроцедуры

&НаКлиенте
Процедура Упаковка(Команда)
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытияФормы.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытияФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытияФормы.Вставить("Номенклатура", Номенклатура);
	ПараметрыОткрытияФормы.Вставить("Склад", Склад);
	ПараметрыОткрытияФормы.Вставить("Помещение", Помещение);
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		ОткрытьФорму(
			"Справочник.УпаковкиЕдиницыИзмерения.Форма.ФормаВыбораИзДокументов",
			ПараметрыОткрытияФормы,
			ЭтотОбъект,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ОткрытьФорму(
			"Справочник.УпаковкиЕдиницыИзмерения.Форма.ФормаВыбораИзДокументовАвтономныйРежим",
			ПараметрыОткрытияФормы,
			ЭтотОбъект,,,,,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УвеличитьКоличество(Команда)
	КоличествоУпаковок = КоличествоУпаковок + 1;
КонецПроцедуры

&НаКлиенте
Процедура УменьшитьКоличество(Команда)
	
	КоличествоУпаковок = КоличествоУпаковок - 1;
	
	Если КоличествоУпаковок < 0 Тогда
		КоличествоУпаковок = 0 ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЯчейку(Команда)
	
	Описание = Новый ОписаниеОповещения("РезультатЗаменыЯчейки", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Помещение", Помещение);
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
	ПараметрыФормы.Вставить("Характеристика", Характеристика);
	ПараметрыФормы.Вставить("Серия", Серия);
	ПараметрыФормы.Вставить("Режим", Режим);
	
	ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.Ячейки",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура Штрихкоды(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
	ПараметрыФормы.Вставить("Упаковка", Упаковка);
	
	ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.Штрихкоды",ПараметрыФормы,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
	
	ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.РедактированиеТовара",ПараметрыФормы,
		ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура МаксимальноеКоличество(Команда)
	КоличествоУпаковок = МаксимальноеКоличествоУпаковок;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФото(Команда)
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить("ВыбратьФото", НСтр("ru = 'Выбрать фото'"));
	СписокЗначений.Добавить("СделатьФото", НСтр("ru = 'Сделать фото'"));
	СписокЗначений.Добавить("Отмена", НСтр("ru = 'Отмена'"));
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаФото", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, НСтр("ru = 'Добавить фотографию к товару'"), СписокЗначений, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура КодыМаркировки(Команда)
	
	Описание = Новый ОписаниеОповещения("ИзменитьШтрихкодыУпаковок", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	
	ОткрытьФорму(
		"Обработка.МобильноеРабочееМестоКладовщика.Форма.СписокКодовМаркировки",ПараметрыФормы,
		ЭтотОбъект,,,,Описание,
		РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры

&НаКлиенте
Процедура СерияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура();
	Отбор.Вставить("ВидНоменклатуры", ВидНоменклатуры);
	Отбор.Вставить("СрокГодности", СрокГодности);
	
	ВыборСерии = Новый ОписаниеОповещения("ВыборСерии", ЭтотОбъект);
	
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаВыбора", Отбор, ЭтотОбъект,,,, ВыборСерии);
	Иначе
		ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаВыбораАвтономныйРежим", Отбор, ЭтотОбъект,,,, ВыборСерии);
	КонецЕсли;
	
КонецПроцедуры

#Если МобильныйКлиент Тогда
&НаКлиенте
Процедура СканированиеШтрихкода(Команда)
			
	Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда		
		ОбработчикСканирования = Новый ОписаниеОповещения("ОбработкаСканирования", ЭтотОбъект);
		СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(НСтр("ru = 'Наведите камеру на штрихкод'"), ОбработчикСканирования,,
			ТипШтрихКода.Линейный);
	КонецЕсли;
			
КонецПроцедуры
#КонецЕсли

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Если МобильныйКлиент Тогда 
&НаКлиенте
Процедура ОбработкаСканирования(ШтрихкодКамера, Результат, Сообщение, ДополнительныеПараметры) Экспорт

	Если Результат Тогда
		СредстваМультимедиа.ВоспроизвестиЗвуковоеОповещение(ЗвуковоеОповещение.ПоУмолчанию, Истина);
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		
		Штрихкод = ШтрихкодКамера;
		ОбработатьШтрихкод(Новый Структура("Штрихкод", Штрихкод));
	Иначе
		Сообщение = НСтр("ru = 'Ошибка обработки штрихкода'");
	КонецЕсли;
	
КонецПроцедуры
#КонецЕсли

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ПолитикаУчетаСерий = Обработки.МобильноеРабочееМестоКладовщика.ПолитикаУчетаСерий(ВидНоменклатуры, Склад);
	ПустаяСерия = Справочники.СерииНоменклатуры.ПустаяСсылка();
	
	Элементы.Характеристика.Видимость = ИспользоватьХарактеристики;
	Элементы.Упаковка.Заголовок = Упаковка;
	
	Элементы.ГруппаФотоДобавить.Видимость = НЕ ЗначениеЗаполнено(ФотоТовара1) 
	И НЕ ЗначениеЗаполнено(ФотоТовара2)
	И НЕ ЗначениеЗаполнено(ФотоТовара3);
	Элементы.ГруппаФото1.Видимость = ЗначениеЗаполнено(ФотоТовара1);
	Элементы.ГруппаФото2.Видимость = ЗначениеЗаполнено(ФотоТовара2);
	Элементы.ГруппаФото3.Видимость = ЗначениеЗаполнено(ФотоТовара3);
	
	Элементы.ВыбратьЯчейку.Видимость      = Ложь;
	
	Элементы.Назначение.Видимость = Константы.ИспользоватьОбособленноеОбеспечениеЗаказов.Получить();
	
	Если Режим = "Просмотр" Тогда
		
		Элементы.Количество.Вид                   = ВидПоляФормы.ПолеНадписи;
		Элементы.Упаковка.Доступность             = Ложь;
		Элементы.Характеристика.Доступность       = Ложь;
		Элементы.Серия.Доступность                = Ложь;
		Элементы.СоздатьСерию.Видимость           = Ложь;
		Элементы.Назначение.Доступность           = Ложь;
		Элементы.Подтвердить.Видимость            = Ложь;
		Элементы.Количество.ТолькоПросмотр        = Истина;
		Элементы.МаксимальноеКоличество.Видимость = Ложь;
		Элементы.Минус.Видимость                  = Ложь;
		Элементы.Плюс.Видимость                   = Ложь;
		Если ЗначениеЗаполнено(Ячейка) Тогда
			Элементы.ВыбратьЯчейку.Видимость = Истина;
			Элементы.ВыбратьЯчейку.Заголовок = Ячейка; 
			Элементы.ВыбратьЯчейку.Доступность = Ложь;
		КонецЕсли;
				
	ИначеЕсли Режим = "Приемка" ИЛИ Режим = "РедактированиеПриемка" Тогда
		Элементы.Количество.Вид             = ВидПоляФормы.ПолеВвода;
		Элементы.Подтвердить.Видимость      = Истина;
		Элементы.Подтвердить.Заголовок      = НСтр("ru = 'Принять'");
		Элементы.МаксимальноеКоличество.Заголовок = СтрШаблон(НСтр("ru = 'Заполнить %1'"), МаксимальноеКоличествоУпаковок);
		
		Если ЗначениеЗаполнено(Упаковка) Тогда
			Элементы.Упаковка.Заголовок = Упаковка;
		КонецЕсли;
		
		Элементы.ГруппаСерия.Видимость = Ложь;
		
		Если ЗначениеЗаполнено(ПолитикаУчетаСерий) Тогда
			ИспользоватьСерии = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(ПолитикаУчетаСерий, "УказыватьПриПриемке");
		Иначе
			ИспользоватьСерии = Ложь;
		КонецЕсли;
		
		Если ИспользоватьСерии Тогда
			Элементы.ГруппаСерия.Видимость = Истина;
		Иначе
			Серия = ПустаяСерия;
		КонецЕсли;

	ИначеЕсли Режим = "ПодборВКорзину" Тогда
		Элементы.Количество.Вид             = ВидПоляФормы.ПолеВвода;
		Элементы.Подтвердить.Видимость      = Истина;
		Элементы.Упаковка.Доступность       = Ложь;
		Элементы.Назначение.Доступность     = Ложь;
		Элементы.Подтвердить.Заголовок      = НСтр("ru = 'Подтвердить'");
		
		Если ЗначениеЗаполнено(Упаковка) Тогда
			Элементы.Упаковка.Заголовок = Упаковка;
		КонецЕсли;
		
	ИначеЕсли Режим = "Отгрузка" ИЛИ Режим = "РедактированиеОтгрузка" Тогда
		Элементы.Количество.Вид             = ВидПоляФормы.ПолеВвода;
		Элементы.Подтвердить.Видимость      = Истина; 
		Элементы.Подтвердить.Заголовок  = НСтр("ru = 'Отгрузить'");
		Элементы.МаксимальноеКоличество.Заголовок = СтрШаблон(НСтр("ru = 'Заполнить %1'"), МаксимальноеКоличествоУпаковок);
		
		Если ЗначениеЗаполнено(Упаковка) Тогда
			Элементы.Упаковка.Заголовок = Упаковка;
		КонецЕсли;
		
		Элементы.ГруппаСерия.Видимость = Ложь;
		
		Если ЗначениеЗаполнено(ПолитикаУчетаСерий) Тогда   
			
			СерииПриОтгрузке =  МобильноеРабочееМестоКладовщика.ЗначенияРеквизитовОбъекта(ПолитикаУчетаСерий,
				"УказыватьПриПланированииОтбора, УказыватьПоФактуОтбора, УказыватьПриПланированииОтгрузки");
						
			ИспользоватьСерии = СерииПриОтгрузке.УказыватьПриПланированииОтбора 
				Или СерииПриОтгрузке.УказыватьПоФактуОтбора;
			
			Если ИспользоватьСерии Тогда
				Элементы.ГруппаСерия.Видимость = Истина;
			ИначеЕсли СерииПриОтгрузке.УказыватьПриПланированииОтгрузки Тогда
				Элементы.ГруппаСерия.Видимость = Истина;
				Элементы.Серия.Доступность = Ложь;
				Элементы.СоздатьСерию.Видимость = Ложь;
			Иначе
				Серия = ПустаяСерия;
			КонецЕсли;
		Иначе
			ИспользоватьСерии = Ложь;
			Серия = ПустаяСерия;
		КонецЕсли;
	
	ИначеЕсли Режим = "ПересчетОтгрузка" ИЛИ Режим = "РедактированиеПересчетОтгрузка" 
		Или Режим = "РедактированиеПересчетОтгрузкаБезСерии" Тогда
		
		Элементы.Количество.Вид                   = ВидПоляФормы.ПолеВвода;
		Элементы.Подтвердить.Видимость            = Истина;
		Элементы.МаксимальноеКоличество.Видимость = Ложь;
		
		Элементы.ГруппаСерия.Видимость = Ложь;
		
		Если ЗначениеЗаполнено(Упаковка) Тогда
			Элементы.Упаковка.Заголовок = Упаковка;
		КонецЕсли;
		
		Элементы.ГруппаСерия.Видимость = Ложь;

		Если ЗначениеЗаполнено(ПолитикаУчетаСерий) Тогда
			СерииПриОтгрузке =  МобильноеРабочееМестоКладовщика.ЗначенияРеквизитовОбъекта(ПолитикаУчетаСерий, 
				"УказыватьПоФактуОтбора, УказыватьПриПланированииОтбора, УказыватьПриПланированииОтгрузки");   
				
			ИспользоватьСерии = СерииПриОтгрузке.УказыватьПоФактуОтбора Или СерииПриОтгрузке.УказыватьПриПланированииОтгрузки
				Или СерииПриОтгрузке.УказыватьПриПланированииОтбора; 
				
			Если ИспользоватьСерии Тогда
				Элементы.ГруппаСерия.Видимость = Истина;
			Иначе
				Серия = ПустаяСерия;
			КонецЕсли;
		Иначе
			ИспользоватьСерии = Ложь;
			Серия = ПустаяСерия;
		КонецЕсли;
	
	ИначеЕсли Режим = "Пересчет" ИЛИ Режим = "РедактированиеПересчет" Тогда
		
		Элементы.Количество.Вид                   = ВидПоляФормы.ПолеВвода;
		Элементы.Упаковка.Видимость               = Ложь;
		Элементы.Подтвердить.Видимость            = Истина;
		Элементы.Упаковка.Доступность             = Ложь;
		Элементы.МаксимальноеКоличество.Видимость = Ложь;
		
		Элементы.ГруппаСерия.Видимость = Ложь;
		
		Если ЗначениеЗаполнено(ПолитикаУчетаСерий) Тогда
			ИспользоватьСерии = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(ПолитикаУчетаСерий, "УказыватьПриПересчетеТоваров");
		Иначе
			ИспользоватьСерии = Ложь;
		КонецЕсли;
		
		Если ИспользоватьСерии Тогда
			Элементы.ГруппаСерия.Видимость = Истина; 
		Иначе
			Серия = ПустаяСерия;
		КонецЕсли;
		
		Элементы.ВыбратьЯчейку.Видимость = ИспользоватьАдресноеХранение;
		Если ЗначениеЗаполнено(Ячейка) Тогда
			Элементы.ВыбратьЯчейку.Заголовок = Ячейка;
		КонецЕсли;
		
	ИначеЕсли Режим = "Перемещение" Тогда
		
		Элементы.Количество.Вид                   = ВидПоляФормы.ПолеВвода;
		Элементы.Подтвердить.Видимость            = Истина;
		Элементы.МаксимальноеКоличество.Видимость = Ложь; 
		
		Элементы.ГруппаСерия.Видимость = Ложь;

		Если ЗначениеЗаполнено(ПолитикаУчетаСерий) Тогда
			ИспользоватьСерии = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(ПолитикаУчетаСерий, "УказыватьПриПеремещенииМеждуПомещениями");
		Иначе
			ИспользоватьСерии = Ложь;
		КонецЕсли;
		
		Если ИспользоватьСерии Тогда
			Элементы.ГруппаСерия.Видимость = Истина;
		Иначе
			Серия = ПустаяСерия;
		КонецЕсли;
		
		Элементы.ВыбратьЯчейку.Видимость = ИспользоватьАдресноеХранение;
		Если ЗначениеЗаполнено(Ячейка) Тогда
			Элементы.ВыбратьЯчейку.Заголовок = Ячейка;
		КонецЕсли;

	ИначеЕсли Режим = "РазмещениеВЯчейку" ИЛИ Режим = "РедактированиеРазмещениеПоЯчейкам" Тогда
		
		Элементы.Количество.Вид             = ВидПоляФормы.ПолеВвода;
		Элементы.Подтвердить.Видимость      = Истина;
		Элементы.ВыбратьЯчейку.Видимость    = Истина;
		Элементы.Подтвердить.Заголовок      = НСтр("ru = 'Разместить'");
		Элементы.МаксимальноеКоличество.Заголовок = СтрШаблон(НСтр("ru = 'Заполнить %1'"), МаксимальноеКоличествоУпаковок);
		
		Если ЗначениеЗаполнено(Упаковка) Тогда
			Элементы.Упаковка.Заголовок = Упаковка;
		КонецЕсли;
		
		Элементы.ВыбратьЯчейку.Видимость = ИспользоватьАдресноеХранение;
		Если ЗначениеЗаполнено(Ячейка) Тогда
			Элементы.ВыбратьЯчейку.Заголовок = Ячейка;
		КонецЕсли;
		
	ИначеЕсли Режим = "ОтборИзЯчейкиОтгрузка" ИЛИ Режим = "РедактированиеОтборИзЯчейкиОтгрузка" Тогда
		
		Элементы.Количество.Вид             = ВидПоляФормы.ПолеВвода;
		Элементы.Подтвердить.Видимость      = Истина;
		Элементы.Подтвердить.Заголовок      = НСтр("ru = 'Отобрать'");
		Элементы.МаксимальноеКоличество.Заголовок = СтрШаблон(НСтр("ru = 'Заполнить %1'"), МаксимальноеКоличествоУпаковок);
		
		Элементы.ВыбратьЯчейку.Видимость = ИспользоватьАдресноеХранение;
		Если ЗначениеЗаполнено(Ячейка) Тогда
			Элементы.ВыбратьЯчейку.Заголовок = Ячейка;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Упаковка) Тогда
			Элементы.Упаковка.Заголовок = Упаковка;
		КонецЕсли;

		Элементы.ГруппаСерия.Видимость = Ложь;

		Если ЗначениеЗаполнено(ПолитикаУчетаСерий) Тогда
			
			СерииПриОтгрузке =  МобильноеРабочееМестоКладовщика.ЗначенияРеквизитовОбъекта(ПолитикаУчетаСерий, 
				"УказыватьПоФактуОтбора, УказыватьПриПланированииОтбора, УказыватьПриПланированииОтгрузки, УчитыватьОстаткиСерий"); 
			
			Если ИспользоватьАдресноеХранение Тогда
				ИспользоватьСерии = СерииПриОтгрузке.УказыватьПоФактуОтбора И СерииПриОтгрузке.УчитыватьОстаткиСерий; 
			Иначе
				ИспользоватьСерии = СерииПриОтгрузке.УказыватьПриПланированииОтбора;
			КонецЕсли;
				
			Если ИспользоватьСерии Тогда
				Элементы.ГруппаСерия.Видимость = Истина;
			ИначеЕсли СерииПриОтгрузке.УказыватьПриПланированииОтгрузки 
				Или СерииПриОтгрузке.УказыватьПриПланированииОтбора Тогда
				Элементы.ГруппаСерия.Видимость = Истина;
				Элементы.Серия.Доступность = Ложь;
				Элементы.СоздатьСерию.Видимость = Ложь;
			Иначе
				Серия = ПустаяСерия;
			КонецЕсли;
		Иначе
			ИспользоватьСерии = Ложь;
			Серия = ПустаяСерия;
		КонецЕсли;
		
	ИначеЕсли Режим = "УказаниеСерий" Или Режим = "РедактированиеСерий" Тогда
		
		Элементы.Количество.Вид             = ВидПоляФормы.ПолеВвода;
		Элементы.Подтвердить.Видимость      = Истина;
		Элементы.Подтвердить.Заголовок      = НСтр("ru = 'Подтвердить'");
		Элементы.МаксимальноеКоличество.Заголовок = СтрШаблон(НСтр("ru = 'Заполнить %1'"), МаксимальноеКоличествоУпаковок);
		
		Элементы.ВыбратьЯчейку.Видимость = ИспользоватьАдресноеХранение;
		Если ЗначениеЗаполнено(Ячейка) Тогда
			Элементы.ВыбратьЯчейку.Заголовок = Ячейка;
		КонецЕсли;
		
		Элементы.ГруппаСерия.Видимость = Истина;
		ИспользоватьСерии = Истина;
		
	КонецЕсли;
	
	Элементы.Количество.Шрифт = Новый Шрифт(, 16, Истина, , , );
	
	Если Не ИспользоватьСерии Тогда
		Элементы.Серия.Доступность = Ложь;
		Элементы.СоздатьСерию.Видимость = Ложь;
	Иначе
#Если МобильныйАвтономныйСервер Тогда
		Элементы.Серия.КнопкаСоздания = Ложь;
		Элементы.СоздатьСерию.Видимость = Ложь;
#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(ДанныеШтрихкода)
		
	ШтрихкодыВалидны = МобильноеРабочееМестоКладовщикаКлиент.ШтрихкодыВалидны(ДанныеШтрихкода); 
	
	Если Не ШтрихкодыВалидны Тогда
		Возврат;
	КонецЕсли;
	
	Штрихкод = ДанныеШтрихкода.Штрихкод;
	
	Если ШтрихкодДокумента = Штрихкод Тогда
		Если Элементы.ВыбратьЯчейку.Видимость Тогда
			Если ПорядокСканирования = "СначалаСканированиеЯчейки" Тогда
				ЗакрытьКарточкуТовара(,,Истина);
			ИначеЕсли Ячейка.Пустая() Тогда
				Состояние(НСтр("ru = 'Укажите ячейку'"));
			Иначе
				ЗакрытьКарточкуТовара();
			КонецЕсли;
		Иначе
			ЗакрытьКарточкуТовара();
		КонецЕсли;
		Возврат;	
	КонецЕсли;
	
	Если ИспользоватьСерии Тогда
		
		ПараметрыСерии = ПолучитьПараметрыСерииНаСервере(Штрихкод);
				
		Если ЗначениеЗаполнено(ПараметрыСерии.Серия) Тогда
			Серия = ПараметрыСерии.Серия;
			КоличествоУпаковок = КоличествоУпаковок + 1;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеТоваров = ДанныеТоваровПоШК(Штрихкод);
	
	Если ЗначениеЗаполнено(ДанныеТоваров) Тогда
		Если ДанныеТоваров.Количество() > 1 Тогда
			ЗакрытьКарточкуТовара(ДанныеТоваров);
		ИначеЕсли ДанныеТоваров[0].Номенклатура = Номенклатура
			И ДанныеТоваров[0].Характеристика = Характеристика
			И ДанныеТоваров[0].Упаковка = Упаковка
			И (ДанныеТоваров[0].Серия = Серия Или Не ИспользоватьСерии) Тогда
			
			КоличествоУпаковок = КоличествоУпаковок + ДанныеТоваров[0].Количество;
		Иначе
			ЗакрытьКарточкуТовара(ДанныеТоваров);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	Если Элементы.ВыбратьЯчейку.Видимость Тогда 
		
		ДанныеЯчейки = ДанныеЯчейкиПоШК(Штрихкод); 
		Если ЗначениеЗаполнено(ДанныеЯчейки.Ячейка) Тогда
			Если ДанныеЯчейки.Ячейка = Ячейка Тогда
				ЗакрытьКарточкуТовара(); 
			ИначеЕсли Режим = "Перемещение" Тогда 
				ЗакрытьКарточкуТовара(,ДанныеЯчейки, Истина);
			Иначе
				ЗакрытьКарточкуТовара(,ДанныеЯчейки);
			КонецЕсли;
		
			Возврат;
		КонецЕсли;
		
		Состояние(НСтр("ru = 'Номенклатура или ячейка по штрихкоду не найдена'"));
		Возврат;
		
	КонецЕсли;
	
	Состояние(НСтр("ru = 'Номенклатура по штрихкоду не найдена'"));

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФотоТовара()

#Если НЕ МобильныйАвтономныйСервер Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
		|ГДЕ
		|	НоменклатураПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|	И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Сч = 1;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если Сч > 3 Тогда
			Продолжить;
		КонецЕсли;
		
		СсылкаНаДДФ = РаботаСФайлами.ДанныеФайла(ВыборкаДетальныеЗаписи.Ссылка, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		ЭтотОбъект["ФотоТовара" + Сч] = СсылкаНаДДФ;
		
		Сч = Сч + 1;
		
	КонецЦикла;	
#КонецЕсли
КонецПроцедуры

&НаСервере
Функция ЕдиницаИзмеренияНоменклатуры()
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ПолучитьРеквизитСправочника(Номенклатура, "ЕдиницаИзмерения");
	
КонецФункции

&НаКлиенте
Процедура РезультатЗаменыЯчейки(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Ячейка = Результат;
	Элементы.ВыбратьЯчейку.Заголовок = Ячейка;
	
	Если Режим = "РазмещениеВЯчейку" Или Режим = "РедактированиеРазмещениеПоЯчейкам" 
		Или Режим = "Перемещение" Или Режим = "ОтборИзЯчейки" Или Режим = "РедактированиеОтборИзЯчейки" 
		Или Режим = "ОтборИзЯчейкиОтгрузка" Или Режим = "РедактированиеОтборИзЯчейкиОтгрузка" Тогда
		
		Назначение = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаФото(Результат, Параметры) Экспорт
	
	Если Результат = "ВыбратьФото" Тогда
		
#Если МобильныйКлиент Тогда
		Выполнить("РаботаСФайламиКлиент.ДобавитьФайлы(Номенклатура, УникальныйИдентификатор, , Неопределено)");
#Иначе
		РаботаСФайламиКлиент.ДобавитьФайлы(Номенклатура, УникальныйИдентификатор, , Неопределено);
#КонецЕсли
		ЗагрузитьФотоТовара();
		УстановитьУсловноеОформление();
		
	ИначеЕсли Результат = "СделатьФото" Тогда
		
#Если МобильныйКлиент Тогда
		ДвоичныеДанные = ПолучитьДанныеФотоСнимка();
		ПрисоединитьФайл(ДвоичныеДанные);
		ЗагрузитьФотоТовара();
		УстановитьУсловноеОформление();
#Иначе
		Состояние(НСтр("ru = 'Данное устройство не поддерживает фотоснимок'"));
#КонецЕсли
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьШтрихкодыУпаковок(Результат, Параметры) Экспорт
	
	ИзменитьШтрихкодыУпаковокНаСервере(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьШтрихкодыУпаковокНаСервере(Результат)
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ШтрихкодыУпаковок.Очистить();
	ШтрихкодыУпаковок.Загрузить(Результат.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьДанныеФотоСнимка()
	
	Данные = Неопределено;
	
#Если МобильныйКлиент Тогда 
		
	Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
			
		Данные = СредстваМультимедиа.СделатьФотоснимок();
			
		Возврат Данные.ПолучитьДвоичныеДанные();
			
	Иначе
		Состояние(НСтр("ru = 'Данное устройство не поддерживает фотоснимок'"));
	КонецЕсли;
		
#КонецЕсли
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Процедура ПрисоединитьФайл(ДвоичныеДанные)

#Если НЕ МобильныйАвтономныйСервер Тогда
	
	ВременноеХранилище                = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	ПараметрыФайла                    = РаботаСФайлами.ПараметрыДобавленияФайла();
	ПараметрыФайла.Автор              = Пользователи.ТекущийПользователь();
	ПараметрыФайла.ИмяБезРасширения   = Строка(Номенклатура);
	ПараметрыФайла.РасширениеБезТочки = "jpg";
	ПараметрыФайла.ВладелецФайлов = Номенклатура;
	РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, ВременноеХранилище);
	
#КонецЕсли

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеТоваровПоШК(Штрихкод)
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ДанныеТоваровПоШК(Штрихкод);
	
КонецФункции

&НаСервере
Функция ДанныеЯчейкиПоШК(Знач Штрихкод)
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ДанныеЯчейкиПоШК(Склад, Помещение, Штрихкод);
	
КонецФункции

&НаКлиенте
Процедура ЗакрытьКарточкуТовара(ДанныеСледующегоТовара = Неопределено, 
		ДанныеСледующейЯчейки = Неопределено, ОтсканированШКДокумента = Ложь)
	
	ТекстОшибки = "";
	ЗакрытьКарточкуТовараНаСервере(ТекстОшибки);
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		Состояние(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Структура = Новый Структура;
	Структура.Вставить("Номенклатура", Номенклатура);
	Структура.Вставить("Характеристика", Характеристика);
	Структура.Вставить("Серия", Серия);
	Структура.Вставить("Упаковка", Упаковка);
	Структура.Вставить("КоличествоУпаковок", КоличествоУпаковок);
	Структура.Вставить("Назначение", Назначение);
	Структура.Вставить("НомерСтроки", НомерСтроки);
	Структура.Вставить("Ячейка", Ячейка);
	Структура.Вставить("Режим", Режим);
	Структура.Вставить("ШтрихкодыУпаковок", ШтрихкодыУпаковок);
	Структура.Вставить("Артикул", Артикул);
	Структура.Вставить("ДанныеСледующегоТовара", ДанныеСледующегоТовара);
	Структура.Вставить("ДанныеСледующейЯчейки", ДанныеСледующейЯчейки);
	Структура.Вставить("ЗакрытьКарточку", ОтсканированШКДокумента);

	Закрыть(Структура);
	
КонецПроцедуры  

&НаСервере
Процедура ЗакрытьКарточкуТовараНаСервере(ТекстОшибки)
	
	УпаковкаЗаполнена = Не (Обработки.МобильноеРабочееМестоКладовщика.ПолучитьРеквизитСправочника(Упаковка,
		"Владелец") = Справочники.НаборыУпаковок.БазовыеЕдиницыИзмерения 
		И Обработки.МобильноеРабочееМестоКладовщика.ПолучитьРеквизитСправочника(Упаковка, 
		"ТипИзмеряемойВеличины") = Перечисления.ТипыИзмеряемыхВеличин.КоличествоШтук);
	
	Если Не УпаковкаЗаполнена И Режим = "Приемка" И ИспользоватьАдресноеХранение Тогда
		ТекстОшибки = ТекстОшибки + НСтр("ru = 'Укажите упаковку'");
	КонецЕсли;
	
	Если Режим = "Приемка" Или Режим = "РедактированиеПриемка" 
		Или Режим = "Отгрузка" Или Режим = "РедактированиеОтгрузка" Или Режим = "Пересчет" Или Режим = "Перемещение" 
		Или Режим = "РедактированиеПересчетОтгрузка" Или Режим = "ПересчетОтгрузка"
		Или Режим = "РедактированиеПересчетОтгрузкаБезСерии"
		Или Режим = "ОтборИзЯчейкиОтгрузка" Или Режим = "РедактированиеОтборИзЯчейкиОтгрузка"
		Или Режим =  "УказаниеСерий" Или Режим =  "РедактированиеСерий" Тогда
	
		Если ИспользоватьХарактеристики и НЕ ЗначениеЗаполнено(Характеристика) Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Укажите характеристику'");
		КонецЕсли;
		
		Если ИспользоватьСерии И НЕ ЗначениеЗаполнено(Серия) Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Укажите серию'");
		КонецЕсли;
		
		Если КоличествоУпаковок = 0 Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Укажите количество'");
		КонецЕсли;
		
		Если ИспользоватьСерии И ЗначениеЗаполнено(Серия) Тогда
			НастройкаИспользованияСерий = МобильноеРабочееМестоКладовщика.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "НастройкаИспользованияСерий");
			Если НастройкаИспользованияСерий = Перечисления.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара Тогда  
				КоэффициентУпаковки = МобильноеРабочееМестоКладовщика.КоэффициентУпаковки(Упаковка, Номенклатура);
				Если КоличествоУпаковок > 1 Тогда
					ШаблонСообщения = НСтр("ru = 'Указанное количество товара с серией ""%1"" равно %2. Политика учета серий данного товара предусматривает, что количество по любой серии этого товара всегда будет равно 1.'");
					ТекстСообщения = СтрШаблон(ШаблонСообщения, Серия, Формат(КоличествоУпаковок, "ЧН=0; ЧГ="));		
					ТекстОшибки = ТекстОшибки + Символы.ПС + ТекстСообщения; 
				ИначеЕсли КоэффициентУпаковки <> 1 Тогда
					ТекстСообщения = НСтр("ru = 'Политика учета серий товара предусматривает, что серии указываются для каждого экземпляра. Укажите единичную упаковку.'");
					ТекстОшибки = ТекстОшибки + Символы.ПС + ТекстСообщения; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если (Режим = "ОтборИзЯчейкиОтгрузка" Или Режим = "Пересчет") И Не ЗначениеЗаполнено(Ячейка) 
			И ИспользоватьАдресноеХранение И ПорядокСканирования = "СначалаСканированиеЯчейки" Тогда
			ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Укажите ячейку'");
		КонецЕсли;
		
	КонецЕсли;
	
	Если Режим = "РазмещениеВЯчейку" И Не ЗначениеЗаполнено(Ячейка) 
		И ПорядокСканирования = "СначалаСканированиеЯчейки" Тогда
		ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Укажите ячейку'");
	КонецЕсли;
	
	Если Не МаркиОтсканированыСервер() Тогда
		
		ТекстОшибки = ТекстОшибки + Символы.ПС + НСтр("ru = 'Укажите коды маркировки'");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыСерииНаСервере(Знач Штрихкод)
	
	Возврат Обработки.МобильноеРабочееМестоКладовщика.ПолучитьПараметрыСерииПоШК(Штрихкод, ВидНоменклатуры);
	
КонецФункции

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Если КоличествоУпаковок < 0 Тогда
		КоличествоУпаковок = 0;
		Состояние(НСтр("ru = 'Нельзя указать отрицательное значение'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция МаркиОтсканированыСервер()
	
	МаркиОтсканированы = Обработки.МобильноеРабочееМестоКладовщика.МаркиОтсканированы(Номенклатура, КоличествоУпаковок, Упаковка, ШтрихкодыУпаковок);
	Возврат МаркиОтсканированы;
	
КонецФункции

&НаКлиенте
Процедура ВыборСерии(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Серия = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура СерияСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СозданиеСерии();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСерию(Команда)
	
	СозданиеСерии();
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеСерии()
	
	Отбор = Новый Структура();
	Отбор.Вставить("ВидНоменклатуры", ВидНоменклатуры);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",Отбор);
	ПараметрыФормы.Вставить("СрокГодности", СрокГодности);
	
	ОткрытьФорму("Справочник.СерииНоменклатуры.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязиПараметровВыбораНазначения()
	
	СвязиПараметровВыбора = Новый Массив();
	ПараметрыВыбора = Новый Массив();
	
	Если Режим = "Отгрузка" ИЛИ Режим = "РедактированиеОтгрузка" 
		ИЛИ Режим = "ПересчетОтгрузка" ИЛИ Режим = "РедактированиеПересчетОтгрузка" 
		ИЛИ Режим = "Пересчет" ИЛИ Режим = "РедактированиеПересчет" Тогда
		
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Номенклатура", "Номенклатура", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Характеристика", "Характеристика", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Склад", "Склад", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Источник", "ДокументИсточник", РежимИзмененияСвязанногоЗначения.Очищать));
		
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ДвиженияПоСкладскимРегистрам", Истина));
		
	ИначеЕсли Режим = "Приемка" ИЛИ Режим = "РедактированиеПриемка" Тогда
		
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Номенклатура", "Номенклатура", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Характеристика", "Характеристика", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Склад", "Склад", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Источник", "ДокументИсточник", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Распоряжение", "РаспоряжениеНаПоступление", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("ВидОперации", "СкладскаяОперация", РежимИзмененияСвязанногоЗначения.НеИзменять));
		
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ТолькоСкладскиеНазначения", Истина));
		ВариантыВыбора = Новый Массив;
		ВариантыВыбора.Добавить(0);
		ВариантыВыбора.Добавить(5);
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("ВариантыВыбора", Новый ФиксированныйМассив(ВариантыВыбора)));
		
	ИначеЕсли Режим = "РазмещениеВЯчейку" ИЛИ Режим = "РедактированиеРазмещениеПоЯчейкам" Тогда
		
		ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Размещение;
		
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Номенклатура", "Номенклатура", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Характеристика", "Характеристика", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Склад", "Склад", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Источник", "ДокументИсточник", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Ячейка", "Ячейка", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("ВидОперации", "ВидОперации", РежимИзмененияСвязанногоЗначения.НеИзменять));
		
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ДвиженияПоСкладскимРегистрам", Истина));
		
	ИначеЕсли Режим = "Перемещение" Тогда
		
		ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Перемещение;
		
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Номенклатура", "Номенклатура", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Характеристика", "Характеристика", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Склад", "Склад", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Источник", "ДокументИсточник", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Ячейка", "Ячейка", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("ВидОперации", "ВидОперации", РежимИзмененияСвязанногоЗначения.НеИзменять));
		
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ДвиженияПоСкладскимРегистрам", Истина));
		
	ИначеЕсли Режим = "ОтборИзЯчейки" ИЛИ Режим = "РедактированиеОтборИзЯчейки" 
		ИЛИ Режим = "ОтборИзЯчейкиОтгрузка" ИЛИ Режим = "РедактированиеОтборИзЯчейкиОтгрузка" Тогда
		
		ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваров.Отбор;
		
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Номенклатура", "Номенклатура", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Характеристика", "Характеристика", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Склад", "Склад", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Источник", "ДокументИсточник", РежимИзмененияСвязанногоЗначения.Очищать));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Ячейка", "Ячейка", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("ВидОперации", "ВидОперации", РежимИзмененияСвязанногоЗначения.НеИзменять));
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Распоряжение", "РаспоряжениеНаОтбор", РежимИзмененияСвязанногоЗначения.НеИзменять));
		
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ДвиженияПоСкладскимРегистрам", Истина));
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("РежимВыбораНазначений", "ОстаткиВЯчейке"));
		
	КонецЕсли;
	
	Элементы.Назначение.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	Элементы.Назначение.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
	
	ВыборХарактеристики = Новый ОписаниеОповещения("ВыборХарактеристики", ЭтотОбъект);
	Если ИспользуемыйСерверФормы = ИспользуемыйСервер.Основной Тогда
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, ВыборХарактеристики);
	Иначе
		ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаВыбораАвтономныйРежим", ПараметрыФормы, ЭтотОбъект,,,, ВыборХарактеристики);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборХарактеристики(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Характеристика = Результат;
	
КонецПроцедуры

#КонецОбласти
